; ModuleID = 'runtime/bb.bc'
source_filename = "runtime/bb.c"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-v7m-none-gnueabi"

%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, [25 x i8], i32, %struct.__locale_t*, i32, void (%struct._reent*)*, %struct._Bigint*, i32, %struct._Bigint*, %struct._Bigint**, i32, i8*, %union.anon.0, %struct._atexit*, %struct._atexit, void (i32)**, %struct._glue, [3 x %struct.__sFILE] }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (%struct._reent*, i8*, i8*, i32)*, i32 (%struct._reent*, i8*, i8*, i32)*, i32 (%struct._reent*, i8*, i32, i32)*, i32 (%struct._reent*, i8*)*, %struct.__sbuf, i8*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i32, %struct._reent*, %struct.__lock*, %struct._mbstate_t, i32 }
%struct.__sbuf = type { i8*, i32 }
%struct.__lock = type opaque
%struct._mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__locale_t = type opaque
%struct._Bigint = type { %struct._Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.anon.0 = type { %struct.anon, [32 x i8] }
%struct.anon = type { i32, i8*, [26 x i8], %struct.__tm, i32, i64, %struct._rand48, %struct._mbstate_t, %struct._mbstate_t, %struct._mbstate_t, [8 x i8], [24 x i8], i32, %struct._mbstate_t, %struct._mbstate_t, %struct._mbstate_t, %struct._mbstate_t, %struct._mbstate_t, i32 }

!479 = !DILocation(line: 376, column: 13, scope: !243)
!480 = !DILocation(line: 379, column: 13, scope: !173)
!481 = !DILocation(line: 0, scope: !255)
!482 = !DILocation(line: 380, column: 13, scope: !250)
!483 = !DILocation(line: 0, scope: !250)
!484 = !DILocation(line: 380, column: 35, scope: !255)
!485 = !DILocation(line: 0, scope: !254)
!486 = !DILocation(line: 381, column: 17, scope: !254)
!487 = !DILocation(line: 381, column: 22, scope: !254)
!488 = !DILocation(line: 382, column: 32, scope: !254)
!489 = !DILocation(line: 383, column: 26, scope: !490)
!490 = distinct !DILexicalBlock(scope: !254, file: !3, line: 383, column: 21)
!491 = !DILocation(line: 383, column: 21, scope: !254)
!492 = !DILocation(line: 387, column: 13, scope: !255)
!493 = !DILocation(line: 380, column: 68, scope: !255)
!494 = !DILocation(line: 380, column: 13, scope: !255)
!495 = distinct !{!495, !482, !496}
!496 = !DILocation(line: 387, column: 13, scope: !250)
!497 = !DILocation(line: 389, column: 5, scope: !153)
!498 = !DILocation(line: 390, column: 1, scope: !153)
!499 = distinct !DISubprogram(name: "__wrap_vprintf", scope: !3, file: !3, line: 397, type: !500, scopeLine: 397, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !502)
!500 = !DISubroutineType(types: !501)
!501 = !{!12, !17, !159}
!502 = !{!503, !504}
!503 = !DILocalVariable(name: "format", arg: 1, scope: !499, file: !3, line: 397, type: !17)
!504 = !DILocalVariable(name: "args", arg: 2, scope: !499, file: !3, line: 397, type: !159)
!505 = !DILocation(line: 0, scope: !499)
!506 = !DILocation(line: 398, column: 12, scope: !499)
!507 = !DILocation(line: 398, column: 5, scope: !499)
!508 = distinct !DISubprogram(name: "__box_vprintf_write", scope: !3, file: !3, line: 392, type: !157, scopeLine: 392, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !509)
!509 = !{!510, !511, !512}
!510 = !DILocalVariable(name: "ctx", arg: 1, scope: !508, file: !3, line: 392, type: !6)
!511 = !DILocalVariable(name: "buf", arg: 2, scope: !508, file: !3, line: 392, type: !53)
!512 = !DILocalVariable(name: "size", arg: 3, scope: !508, file: !3, line: 392, type: !55)
!513 = !DILocation(line: 0, scope: !508)
!514 = !DILocation(line: 393, column: 24, scope: !508)
!515 = !DILocation(line: 393, column: 12, scope: !508)
!516 = !DILocalVariable(name: "a0", arg: 1, scope: !517, file: !3, line: 670, type: !22)
!517 = distinct !DISubprogram(name: "env___box_write", scope: !3, file: !3, line: 670, type: !518, scopeLine: 670, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !520)
!518 = !DISubroutineType(types: !519)
!519 = !{!22, !22, !7, !7}
!520 = !{!516, !521, !522}
!521 = !DILocalVariable(name: "a1", arg: 2, scope: !517, file: !3, line: 670, type: !7)
!522 = !DILocalVariable(name: "size", arg: 3, scope: !517, file: !3, line: 670, type: !7)
!523 = !DILocation(line: 0, scope: !517, inlinedAt: !524)
!524 = distinct !DILocation(line: 393, column: 12, scope: !508)
!525 = !DILocation(line: 672, column: 13, scope: !517, inlinedAt: !524)
!526 = !DILocalVariable(name: "off", arg: 1, scope: !527, file: !3, line: 446, type: !7)
!527 = distinct !DISubprogram(name: "to_ptr", scope: !3, file: !3, line: 446, type: !528, scopeLine: 446, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !530)
!528 = !DISubroutineType(types: !529)
!529 = !{!6, !7}
!530 = !{!526}
!531 = !DILocation(line: 0, scope: !527, inlinedAt: !532)
!532 = distinct !DILocation(line: 672, column: 43, scope: !517, inlinedAt: !524)
!533 = !DILocation(line: 447, column: 13, scope: !527, inlinedAt: !532)
!534 = !DILocation(line: 671, column: 12, scope: !517, inlinedAt: !524)
!535 = !DILocation(line: 393, column: 5, scope: !508)
!536 = distinct !DISubprogram(name: "__wrap_printf", scope: !3, file: !3, line: 402, type: !537, scopeLine: 402, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !539)
!537 = !DISubroutineType(types: !538)
!538 = !{!12, !17, null}
!539 = !{!540, !541, !542}
!540 = !DILocalVariable(name: "format", arg: 1, scope: !536, file: !3, line: 402, type: !17)
!541 = !DILocalVariable(name: "args", scope: !536, file: !3, line: 403, type: !159)
!542 = !DILocalVariable(name: "res", scope: !536, file: !3, line: 405, type: !12)
!543 = !DILocation(line: 0, scope: !536)
!544 = !DILocation(line: 403, column: 5, scope: !536)
!545 = !DILocation(line: 404, column: 5, scope: !536)
!546 = !DILocation(line: 405, column: 19, scope: !536)
!547 = !DILocation(line: 406, column: 5, scope: !536)
!548 = !DILocation(line: 408, column: 1, scope: !536)
!549 = !DILocation(line: 407, column: 5, scope: !536)
!550 = distinct !DISubprogram(name: "__wrap_vfprintf", scope: !3, file: !3, line: 411, type: !551, scopeLine: 411, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !761)
!551 = !DISubroutineType(types: !552)
!552 = !{!12, !553, !17, !159}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !555, line: 66, baseType: !556)
!555 = !DIFile(filename: "/usr/bin/../arm-none-eabi/include/stdio.h", directory: "")
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !557, line: 287, baseType: !558)
!557 = !DIFile(filename: "/usr/bin/../arm-none-eabi/include/sys/reent.h", directory: "")
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !557, line: 181, size: 832, elements: !559)
!559 = !{!560, !562, !563, !564, !565, !566, !571, !572, !573, !727, !731, !737, !741, !742, !743, !744, !746, !748, !749, !750, !752, !753, !759, !760}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !558, file: !557, line: 182, baseType: !561, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !558, file: !557, line: 183, baseType: !16, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !558, file: !557, line: 184, baseType: !16, size: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !558, file: !557, line: 185, baseType: !37, size: 16, offset: 96)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !558, file: !557, line: 186, baseType: !37, size: 16, offset: 112)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !558, file: !557, line: 187, baseType: !567, size: 64, offset: 128)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !557, line: 117, size: 64, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !567, file: !557, line: 118, baseType: !561, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !567, file: !557, line: 119, baseType: !16, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !558, file: !557, line: 188, baseType: !16, size: 32, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !558, file: !557, line: 195, baseType: !6, size: 32, offset: 224)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !558, file: !557, line: 197, baseType: !574, size: 32, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!575 = !DISubroutineType(types: !576)
!576 = !{!16, !577, !6, !620, !16}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !557, line: 608, size: 8512, elements: !579)
!579 = !{!580, !581, !583, !584, !585, !586, !590, !591, !594, !595, !599, !614, !615, !616, !618, !619, !621, !696, !715, !716, !718, !725}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !578, file: !557, line: 610, baseType: !16, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !578, file: !557, line: 615, baseType: !582, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !578, file: !557, line: 615, baseType: !582, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !578, file: !557, line: 615, baseType: !582, size: 32, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !578, file: !557, line: 617, baseType: !16, size: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !578, file: !557, line: 618, baseType: !587, size: 200, offset: 160)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 200, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 25)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !578, file: !557, line: 621, baseType: !16, size: 32, offset: 384)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !578, file: !557, line: 622, baseType: !592, size: 32, offset: 416)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !557, line: 40, flags: DIFlagFwdDecl)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !578, file: !557, line: 624, baseType: !16, size: 32, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !578, file: !557, line: 626, baseType: !596, size: 32, offset: 480)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 32)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !577}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !578, file: !557, line: 629, baseType: !600, size: 32, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !557, line: 47, size: 192, elements: !602)
!602 = !{!603, !604, !605, !606, !607, !608}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !601, file: !557, line: 49, baseType: !600, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !601, file: !557, line: 50, baseType: !16, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !601, file: !557, line: 50, baseType: !16, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !601, file: !557, line: 50, baseType: !16, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !601, file: !557, line: 50, baseType: !16, size: 32, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !601, file: !557, line: 51, baseType: !609, size: 32, offset: 160)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 32, elements: !612)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !557, line: 22, baseType: !611)
!611 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!612 = !{!613}
!613 = !DISubrange(count: 1)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !578, file: !557, line: 630, baseType: !16, size: 32, offset: 544)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !578, file: !557, line: 631, baseType: !600, size: 32, offset: 576)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !578, file: !557, line: 632, baseType: !617, size: 32, offset: 608)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !578, file: !557, line: 635, baseType: !16, size: 32, offset: 640)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !578, file: !557, line: 636, baseType: !620, size: 32, offset: 672)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_new", scope: !578, file: !557, line: 671, baseType: !622, size: 1920, offset: 704)
!622 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !578, file: !557, line: 638, size: 1920, elements: !623)
!623 = !{!624, !687}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_reent", scope: !622, file: !557, line: 661, baseType: !625, size: 1664)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !622, file: !557, line: 640, size: 1664, elements: !626)
!626 = !{!627, !628, !629, !633, !645, !646, !648, !658, !670, !671, !672, !676, !680, !681, !682, !683, !684, !685, !686}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_unused_rand", scope: !625, file: !557, line: 642, baseType: !11, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !625, file: !557, line: 643, baseType: !620, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !625, file: !557, line: 644, baseType: !630, size: 208, offset: 64)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 208, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 26)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !625, file: !557, line: 645, baseType: !634, size: 288, offset: 288)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !557, line: 55, size: 288, elements: !635)
!635 = !{!636, !637, !638, !639, !640, !641, !642, !643, !644}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !634, file: !557, line: 57, baseType: !16, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !634, file: !557, line: 58, baseType: !16, size: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !634, file: !557, line: 59, baseType: !16, size: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !634, file: !557, line: 60, baseType: !16, size: 32, offset: 96)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !634, file: !557, line: 61, baseType: !16, size: 32, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !634, file: !557, line: 62, baseType: !16, size: 32, offset: 160)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !634, file: !557, line: 63, baseType: !16, size: 32, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !634, file: !557, line: 64, baseType: !16, size: 32, offset: 224)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !634, file: !557, line: 65, baseType: !16, size: 32, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !625, file: !557, line: 646, baseType: !16, size: 32, offset: 576)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !625, file: !557, line: 647, baseType: !647, size: 64, offset: 640)
!647 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !625, file: !557, line: 648, baseType: !649, size: 112, offset: 704)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !557, line: 319, size: 112, elements: !650)
!650 = !{!651, !656, !657}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !649, file: !557, line: 320, baseType: !652, size: 48)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !653, size: 48, elements: !654)
!653 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!654 = !{!655}
!655 = !DISubrange(count: 3)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !649, file: !557, line: 321, baseType: !652, size: 48, offset: 48)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !649, file: !557, line: 322, baseType: !653, size: 16, offset: 96)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !625, file: !557, line: 649, baseType: !659, size: 64, offset: 832)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !15, line: 171, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 163, size: 64, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !660, file: !15, line: 165, baseType: !16, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !660, file: !15, line: 170, baseType: !664, size: 32, offset: 32)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !660, file: !15, line: 166, size: 32, elements: !665)
!665 = !{!666, !668}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !664, file: !15, line: 168, baseType: !667, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !56, line: 116, baseType: !16)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !664, file: !15, line: 169, baseType: !669, size: 32)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 32, elements: !69)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !625, file: !557, line: 650, baseType: !659, size: 64, offset: 896)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !625, file: !557, line: 651, baseType: !659, size: 64, offset: 960)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !625, file: !557, line: 652, baseType: !673, size: 64, offset: 1024)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 8)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !625, file: !557, line: 653, baseType: !677, size: 192, offset: 1088)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 192, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 24)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !625, file: !557, line: 654, baseType: !16, size: 32, offset: 1280)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !625, file: !557, line: 655, baseType: !659, size: 64, offset: 1312)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !625, file: !557, line: 656, baseType: !659, size: 64, offset: 1376)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !625, file: !557, line: 657, baseType: !659, size: 64, offset: 1440)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !625, file: !557, line: 658, baseType: !659, size: 64, offset: 1504)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !625, file: !557, line: 659, baseType: !659, size: 64, offset: 1568)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_h_errno", scope: !625, file: !557, line: 660, baseType: !16, size: 32, offset: 1632)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !622, file: !557, line: 670, baseType: !688, size: 1920)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !622, file: !557, line: 665, size: 1920, elements: !689)
!689 = !{!690, !694}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_nextf", scope: !688, file: !557, line: 668, baseType: !691, size: 960)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 960, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 30)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_nmalloc", scope: !688, file: !557, line: 669, baseType: !695, size: 960, offset: 960)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 960, elements: !692)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !578, file: !557, line: 675, baseType: !697, size: 32, offset: 2624)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 32)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !557, line: 93, size: 3200, elements: !699)
!699 = !{!700, !701, !702, !707}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !698, file: !557, line: 94, baseType: !697, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !698, file: !557, line: 95, baseType: !16, size: 32, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !698, file: !557, line: 97, baseType: !703, size: 1024, offset: 64)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 1024, elements: !705)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!705 = !{!706}
!706 = !DISubrange(count: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args", scope: !698, file: !557, line: 98, baseType: !708, size: 2112, offset: 1088)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !557, line: 74, size: 2112, elements: !709)
!709 = !{!710, !712, !713, !714}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !708, file: !557, line: 75, baseType: !711, size: 1024)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 1024, elements: !705)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !708, file: !557, line: 76, baseType: !711, size: 1024, offset: 1024)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !708, file: !557, line: 78, baseType: !610, size: 32, offset: 2048)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !708, file: !557, line: 81, baseType: !610, size: 32, offset: 2080)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !578, file: !557, line: 676, baseType: !698, size: 3200, offset: 2656)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !578, file: !557, line: 680, baseType: !717, size: 32, offset: 5856)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !578, file: !557, line: 685, baseType: !719, size: 96, offset: 5888)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !557, line: 291, size: 96, elements: !720)
!720 = !{!721, !723, !724}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !719, file: !557, line: 293, baseType: !722, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !719, file: !557, line: 294, baseType: !16, size: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !719, file: !557, line: 295, baseType: !582, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !578, file: !557, line: 687, baseType: !726, size: 2496, offset: 5984)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 2496, elements: !654)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !558, file: !557, line: 199, baseType: !728, size: 32, offset: 288)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 32)
!729 = !DISubroutineType(types: !730)
!730 = !{!16, !577, !6, !17, !16}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !558, file: !557, line: 202, baseType: !732, size: 32, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!733 = !DISubroutineType(types: !734)
!734 = !{!735, !577, !6, !735, !16}
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !15, line: 114, baseType: !736)
!736 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !558, file: !557, line: 203, baseType: !738, size: 32, offset: 352)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!739 = !DISubroutineType(types: !740)
!740 = !{!16, !577, !6}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !558, file: !557, line: 206, baseType: !567, size: 64, offset: 384)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !558, file: !557, line: 207, baseType: !561, size: 32, offset: 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !558, file: !557, line: 208, baseType: !16, size: 32, offset: 480)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !558, file: !557, line: 211, baseType: !745, size: 24, offset: 512)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 24, elements: !654)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !558, file: !557, line: 212, baseType: !747, size: 8, offset: 536)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8, elements: !612)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !558, file: !557, line: 215, baseType: !567, size: 64, offset: 544)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !558, file: !557, line: 218, baseType: !16, size: 32, offset: 608)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !558, file: !557, line: 219, baseType: !751, size: 32, offset: 640)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !15, line: 44, baseType: !736)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !558, file: !557, line: 222, baseType: !577, size: 32, offset: 672)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !558, file: !557, line: 226, baseType: !754, size: 32, offset: 704)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !15, line: 175, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !756, line: 34, baseType: !757)
!756 = !DIFile(filename: "/usr/bin/../arm-none-eabi/include/sys/lock.h", directory: "")
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !756, line: 33, flags: DIFlagFwdDecl)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !558, file: !557, line: 228, baseType: !659, size: 64, offset: 736)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !558, file: !557, line: 229, baseType: !16, size: 32, offset: 800)
!761 = !{!762, !763, !764, !765}
!762 = !DILocalVariable(name: "f", arg: 1, scope: !550, file: !3, line: 411, type: !553)
!763 = !DILocalVariable(name: "format", arg: 2, scope: !550, file: !3, line: 411, type: !17)
!764 = !DILocalVariable(name: "args", arg: 3, scope: !550, file: !3, line: 411, type: !159)
!765 = !DILocalVariable(name: "fd", scope: !550, file: !3, line: 412, type: !22)
!766 = !DILocation(line: 0, scope: !550)
!767 = !DILocation(line: 412, column: 24, scope: !550)
!768 = !{!769, !92, i64 8}
!769 = !{!"_reent", !113, i64 0, !92, i64 4, !92, i64 8, !92, i64 12, !113, i64 16, !93, i64 20, !113, i64 48, !92, i64 52, !113, i64 56, !92, i64 60, !92, i64 64, !113, i64 68, !92, i64 72, !92, i64 76, !113, i64 80, !92, i64 84, !93, i64 88, !92, i64 328, !770, i64 332, !92, i64 732, !773, i64 736, !93, i64 748}
!770 = !{!"_atexit", !92, i64 0, !113, i64 4, !93, i64 8, !771, i64 136}
!771 = !{!"_on_exit_args", !93, i64 0, !93, i64 128, !772, i64 256, !772, i64 260}
!772 = !{!"long", !93, i64 0}
!773 = !{!"_glue", !92, i64 0, !113, i64 4, !92, i64 8}
!774 = !DILocation(line: 412, column: 21, scope: !550)
!775 = !DILocation(line: 413, column: 48, scope: !550)
!776 = !DILocation(line: 413, column: 12, scope: !550)
!777 = !DILocation(line: 413, column: 5, scope: !550)
!778 = distinct !DISubprogram(name: "__wrap_fprintf", scope: !3, file: !3, line: 417, type: !779, scopeLine: 417, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !781)
!779 = !DISubroutineType(types: !780)
!780 = !{!12, !553, !17, null}
!781 = !{!782, !783, !784, !785}
!782 = !DILocalVariable(name: "f", arg: 1, scope: !778, file: !3, line: 417, type: !553)
!783 = !DILocalVariable(name: "format", arg: 2, scope: !778, file: !3, line: 417, type: !17)
!784 = !DILocalVariable(name: "args", scope: !778, file: !3, line: 418, type: !159)
!785 = !DILocalVariable(name: "res", scope: !778, file: !3, line: 420, type: !12)
!786 = !DILocation(line: 0, scope: !778)
!787 = !DILocation(line: 418, column: 5, scope: !778)
!788 = !DILocation(line: 419, column: 5, scope: !778)
!789 = !DILocation(line: 420, column: 19, scope: !778)
!790 = !DILocation(line: 421, column: 5, scope: !778)
!791 = !DILocation(line: 423, column: 1, scope: !778)
!792 = !DILocation(line: 422, column: 5, scope: !778)
!793 = distinct !DISubprogram(name: "__wrap_fflush", scope: !3, file: !3, line: 426, type: !794, scopeLine: 426, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !796)
!794 = !DISubroutineType(types: !795)
!795 = !{!16, !553}
!796 = !{!797, !798}
!797 = !DILocalVariable(name: "f", arg: 1, scope: !793, file: !3, line: 426, type: !553)
!798 = !DILocalVariable(name: "fd", scope: !793, file: !3, line: 427, type: !22)
!799 = !DILocation(line: 0, scope: !793)
!800 = !DILocation(line: 427, column: 24, scope: !793)
!801 = !DILocation(line: 427, column: 21, scope: !793)
!802 = !DILocation(line: 427, column: 18, scope: !793)
!803 = !DILocalVariable(name: "a0", arg: 1, scope: !804, file: !3, line: 675, type: !22)
!804 = distinct !DISubprogram(name: "env___box_flush", scope: !3, file: !3, line: 675, type: !805, scopeLine: 675, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !807)
!805 = !DISubroutineType(types: !806)
!806 = !{!22, !22}
!807 = !{!803}
!808 = !DILocation(line: 0, scope: !804, inlinedAt: !809)
!809 = distinct !DILocation(line: 428, column: 12, scope: !793)
!810 = !DILocation(line: 677, column: 13, scope: !804, inlinedAt: !809)
!811 = !DILocation(line: 676, column: 12, scope: !804, inlinedAt: !809)
!812 = !DILocation(line: 428, column: 5, scope: !793)
!813 = distinct !DISubprogram(name: "_write", scope: !3, file: !3, line: 432, type: !814, scopeLine: 432, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !816)
!814 = !DISubroutineType(types: !815)
!815 = !{!16, !16, !17, !16}
!816 = !{!817, !818, !819}
!817 = !DILocalVariable(name: "handle", arg: 1, scope: !813, file: !3, line: 432, type: !16)
!818 = !DILocalVariable(name: "buffer", arg: 2, scope: !813, file: !3, line: 432, type: !17)
!819 = !DILocalVariable(name: "size", arg: 3, scope: !813, file: !3, line: 432, type: !16)
!820 = !DILocation(line: 0, scope: !813)
!821 = !DILocation(line: 433, column: 12, scope: !813)
!822 = !DILocation(line: 0, scope: !517, inlinedAt: !823)
!823 = distinct !DILocation(line: 433, column: 12, scope: !813)
!824 = !DILocation(line: 672, column: 13, scope: !517, inlinedAt: !823)
!825 = !DILocation(line: 0, scope: !527, inlinedAt: !826)
!826 = distinct !DILocation(line: 672, column: 43, scope: !517, inlinedAt: !823)
!827 = !DILocation(line: 447, column: 13, scope: !527, inlinedAt: !826)
!828 = !DILocation(line: 671, column: 12, scope: !517, inlinedAt: !823)
!829 = !DILocation(line: 433, column: 5, scope: !813)
!830 = !DILocation(line: 0, scope: !527)
!831 = !DILocation(line: 447, column: 13, scope: !527)
!832 = !DILocation(line: 447, column: 5, scope: !527)
!833 = distinct !DISubprogram(name: "from_ptr", scope: !3, file: !3, line: 451, type: !834, scopeLine: 451, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !836)
!834 = !DISubroutineType(types: !835)
!835 = !{!7, !53}
!836 = !{!837}
!837 = !DILocalVariable(name: "ptr", arg: 1, scope: !833, file: !3, line: 451, type: !53)
!838 = !DILocation(line: 0, scope: !833)
!839 = !DILocation(line: 452, column: 26, scope: !833)
!840 = !DILocation(line: 452, column: 5, scope: !833)
!841 = distinct !DISubprogram(name: "get_i8", scope: !3, file: !3, line: 456, type: !842, scopeLine: 456, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !844)
!842 = !DISubroutineType(types: !843)
!843 = !{!31, !7}
!844 = !{!845}
!845 = !DILocalVariable(name: "off", arg: 1, scope: !841, file: !3, line: 456, type: !7)
!846 = !DILocation(line: 0, scope: !841)
!847 = !DILocation(line: 457, column: 15, scope: !841)
!848 = !DILocation(line: 0, scope: !527, inlinedAt: !849)
!849 = distinct !DILocation(line: 458, column: 22, scope: !841)
!850 = !DILocation(line: 447, column: 13, scope: !527, inlinedAt: !849)
!851 = !DILocation(line: 458, column: 12, scope: !841)
!852 = !DILocation(line: 458, column: 5, scope: !841)
!853 = distinct !DISubprogram(name: "get_i16", scope: !3, file: !3, line: 462, type: !854, scopeLine: 462, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !856)
!854 = !DISubroutineType(types: !855)
!855 = !{!35, !7}
!856 = !{!857}
!857 = !DILocalVariable(name: "off", arg: 1, scope: !853, file: !3, line: 462, type: !7)
!858 = !DILocation(line: 0, scope: !853)
!859 = !DILocation(line: 463, column: 15, scope: !853)
!860 = !DILocation(line: 0, scope: !527, inlinedAt: !861)
!861 = distinct !DILocation(line: 464, column: 23, scope: !853)
!862 = !DILocation(line: 447, column: 13, scope: !527, inlinedAt: !861)
!863 = !DILocation(line: 464, column: 13, scope: !853)
!864 = !DILocation(line: 464, column: 12, scope: !853)
!865 = !{!866, !866, i64 0}
!866 = !{!"short", !93, i64 0}
!867 = !DILocation(line: 464, column: 5, scope: !853)
!868 = distinct !DISubprogram(name: "get_i32", scope: !3, file: !3, line: 468, type: !869, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !871)
!869 = !DISubroutineType(types: !870)
!870 = !{!22, !7}
!871 = !{!872}
!872 = !DILocalVariable(name: "off", arg: 1, scope: !868, file: !3, line: 468, type: !7)
!873 = !DILocation(line: 0, scope: !868)
!874 = !DILocation(line: 469, column: 15, scope: !868)
!875 = !DILocation(line: 0, scope: !527, inlinedAt: !876)
!876 = distinct !DILocation(line: 470, column: 23, scope: !868)
!877 = !DILocation(line: 447, column: 13, scope: !527, inlinedAt: !876)
!878 = !DILocation(line: 470, column: 13, scope: !868)
!879 = !DILocation(line: 470, column: 12, scope: !868)
!880 = !DILocation(line: 470, column: 5, scope: !868)
!881 = distinct !DISubprogram(name: "get_i64", scope: !3, file: !3, line: 474, type: !882, scopeLine: 474, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !884)
!882 = !DISubroutineType(types: !883)
!883 = !{!40, !7}
!884 = !{!885}
!885 = !DILocalVariable(name: "off", arg: 1, scope: !881, file: !3, line: 474, type: !7)
!886 = !DILocation(line: 0, scope: !881)
!887 = !DILocation(line: 475, column: 15, scope: !881)
!888 = !DILocation(line: 0, scope: !527, inlinedAt: !889)
!889 = distinct !DILocation(line: 476, column: 23, scope: !881)
!890 = !DILocation(line: 447, column: 13, scope: !527, inlinedAt: !889)
!891 = !DILocation(line: 476, column: 13, scope: !881)
!892 = !DILocation(line: 476, column: 12, scope: !881)
!893 = !{!894, !894, i64 0}
!894 = !{!"long long", !93, i64 0}
!895 = !DILocation(line: 476, column: 5, scope: !881)
!896 = distinct !DISubprogram(name: "get_f32", scope: !3, file: !3, line: 480, type: !897, scopeLine: 480, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !899)
!897 = !DISubroutineType(types: !898)
!898 = !{!44, !7}
!899 = !{!900}
!900 = !DILocalVariable(name: "off", arg: 1, scope: !896, file: !3, line: 480, type: !7)
!901 = !DILocation(line: 0, scope: !896)
!902 = !DILocation(line: 481, column: 15, scope: !896)
!903 = !DILocation(line: 0, scope: !527, inlinedAt: !904)
!904 = distinct !DILocation(line: 482, column: 21, scope: !896)
!905 = !DILocation(line: 447, column: 13, scope: !527, inlinedAt: !904)
!906 = !DILocation(line: 482, column: 13, scope: !896)
!907 = !DILocation(line: 482, column: 12, scope: !896)
!908 = !{!909, !909, i64 0}
!909 = !{!"float", !93, i64 0}
!910 = !DILocation(line: 482, column: 5, scope: !896)
!911 = distinct !DISubprogram(name: "get_f64", scope: !3, file: !3, line: 486, type: !912, scopeLine: 486, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !914)
!912 = !DISubroutineType(types: !913)
!913 = !{!46, !7}
!914 = !{!915}
!915 = !DILocalVariable(name: "off", arg: 1, scope: !911, file: !3, line: 486, type: !7)
!916 = !DILocation(line: 0, scope: !911)
!917 = !DILocation(line: 487, column: 15, scope: !911)
!918 = !DILocation(line: 0, scope: !527, inlinedAt: !919)
!919 = distinct !DILocation(line: 488, column: 22, scope: !911)
!920 = !DILocation(line: 447, column: 13, scope: !527, inlinedAt: !919)
!921 = !DILocation(line: 488, column: 13, scope: !911)
!922 = !DILocation(line: 488, column: 12, scope: !911)
!923 = !{!924, !924, i64 0}
!924 = !{!"double", !93, i64 0}
!925 = !DILocation(line: 488, column: 5, scope: !911)
!926 = distinct !DISubprogram(name: "set_i8", scope: !3, file: !3, line: 492, type: !927, scopeLine: 492, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !929)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !7, !31}
!929 = !{!930, !931}
!930 = !DILocalVariable(name: "off", arg: 1, scope: !926, file: !3, line: 492, type: !7)
!931 = !DILocalVariable(name: "v", arg: 2, scope: !926, file: !3, line: 492, type: !31)
!932 = !DILocation(line: 0, scope: !926)
!933 = !DILocation(line: 493, column: 15, scope: !926)
!934 = !DILocation(line: 0, scope: !527, inlinedAt: !935)
!935 = distinct !DILocation(line: 494, column: 15, scope: !926)
!936 = !DILocation(line: 447, column: 13, scope: !527, inlinedAt: !935)
!937 = !DILocation(line: 494, column: 27, scope: !926)
!938 = !DILocation(line: 495, column: 1, scope: !926)
!939 = distinct !DISubprogram(name: "set_i16", scope: !3, file: !3, line: 498, type: !940, scopeLine: 498, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !942)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !7, !35}
!942 = !{!943, !944}
!943 = !DILocalVariable(name: "off", arg: 1, scope: !939, file: !3, line: 498, type: !7)
!944 = !DILocalVariable(name: "v", arg: 2, scope: !939, file: !3, line: 498, type: !35)
!945 = !DILocation(line: 0, scope: !939)
!946 = !DILocation(line: 499, column: 15, scope: !939)
!947 = !DILocation(line: 0, scope: !527, inlinedAt: !948)
!948 = distinct !DILocation(line: 500, column: 16, scope: !939)
!949 = !DILocation(line: 447, column: 13, scope: !527, inlinedAt: !948)
!950 = !DILocation(line: 500, column: 6, scope: !939)
!951 = !DILocation(line: 500, column: 28, scope: !939)
!952 = !DILocation(line: 501, column: 1, scope: !939)
!953 = distinct !DISubprogram(name: "set_i32", scope: !3, file: !3, line: 504, type: !954, scopeLine: 504, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !956)
!954 = !DISubroutineType(types: !955)
!955 = !{null, !7, !22}
!956 = !{!957, !958}
!957 = !DILocalVariable(name: "off", arg: 1, scope: !953, file: !3, line: 504, type: !7)
!958 = !DILocalVariable(name: "v", arg: 2, scope: !953, file: !3, line: 504, type: !22)
!959 = !DILocation(line: 0, scope: !953)
!960 = !DILocation(line: 505, column: 15, scope: !953)
!961 = !DILocation(line: 0, scope: !527, inlinedAt: !962)
!962 = distinct !DILocation(line: 506, column: 16, scope: !953)
!963 = !DILocation(line: 447, column: 13, scope: !527, inlinedAt: !962)
!964 = !DILocation(line: 506, column: 6, scope: !953)
!965 = !DILocation(line: 506, column: 28, scope: !953)
!966 = !DILocation(line: 507, column: 1, scope: !953)
!967 = distinct !DISubprogram(name: "set_i64", scope: !3, file: !3, line: 510, type: !968, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !970)
!968 = !DISubroutineType(types: !969)
!969 = !{null, !7, !40}
!970 = !{!971, !972}
!971 = !DILocalVariable(name: "off", arg: 1, scope: !967, file: !3, line: 510, type: !7)
!972 = !DILocalVariable(name: "v", arg: 2, scope: !967, file: !3, line: 510, type: !40)
!973 = !DILocation(line: 0, scope: !967)
!974 = !DILocation(line: 511, column: 15, scope: !967)
!975 = !DILocation(line: 0, scope: !527, inlinedAt: !976)
!976 = distinct !DILocation(line: 512, column: 16, scope: !967)
!977 = !DILocation(line: 447, column: 13, scope: !527, inlinedAt: !976)
!978 = !DILocation(line: 512, column: 6, scope: !967)
!979 = !DILocation(line: 512, column: 28, scope: !967)
!980 = !DILocation(line: 513, column: 1, scope: !967)
!981 = distinct !DISubprogram(name: "set_f32", scope: !3, file: !3, line: 516, type: !982, scopeLine: 516, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !984)
!982 = !DISubroutineType(types: !983)
!983 = !{null, !7, !44}
!984 = !{!985, !986}
!985 = !DILocalVariable(name: "off", arg: 1, scope: !981, file: !3, line: 516, type: !7)
!986 = !DILocalVariable(name: "v", arg: 2, scope: !981, file: !3, line: 516, type: !44)
!987 = !DILocation(line: 0, scope: !981)
!988 = !DILocation(line: 517, column: 15, scope: !981)
!989 = !DILocation(line: 0, scope: !527, inlinedAt: !990)
!990 = distinct !DILocation(line: 518, column: 14, scope: !981)
!991 = !DILocation(line: 447, column: 13, scope: !527, inlinedAt: !990)
!992 = !DILocation(line: 518, column: 6, scope: !981)
!993 = !DILocation(line: 518, column: 26, scope: !981)
!994 = !DILocation(line: 519, column: 1, scope: !981)
!995 = distinct !DISubprogram(name: "set_f64", scope: !3, file: !3, line: 522, type: !996, scopeLine: 522, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !998)
!996 = !DISubroutineType(types: !997)
!997 = !{null, !7, !46}
!998 = !{!999, !1000}
!999 = !DILocalVariable(name: "off", arg: 1, scope: !995, file: !3, line: 522, type: !7)
!1000 = !DILocalVariable(name: "v", arg: 2, scope: !995, file: !3, line: 522, type: !46)
!1001 = !DILocation(line: 0, scope: !995)
!1002 = !DILocation(line: 523, column: 15, scope: !995)
!1003 = !DILocation(line: 0, scope: !527, inlinedAt: !1004)
!1004 = distinct !DILocation(line: 524, column: 15, scope: !995)
!1005 = !DILocation(line: 447, column: 13, scope: !527, inlinedAt: !1004)
!1006 = !DILocation(line: 524, column: 6, scope: !995)
!1007 = !DILocation(line: 524, column: 27, scope: !995)
!1008 = !DILocation(line: 525, column: 1, scope: !995)
!1009 = distinct !DISubprogram(name: "get_memory_ptr_for_runtime", scope: !3, file: !3, line: 528, type: !1010, scopeLine: 528, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1012)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!29, !7, !7}
!1012 = !{!1013, !1014}
!1013 = !DILocalVariable(name: "off", arg: 1, scope: !1009, file: !3, line: 528, type: !7)
!1014 = !DILocalVariable(name: "bounds", arg: 2, scope: !1009, file: !3, line: 528, type: !7)
!1015 = !DILocation(line: 0, scope: !1009)
!1016 = !DILocation(line: 529, column: 44, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 529, column: 9)
!1018 = !DILocation(line: 529, column: 30, scope: !1017)
!1019 = !DILocation(line: 529, column: 9, scope: !1009)
!1020 = !{!"branch_weights", i32 1, i32 2000}
!1021 = !DILocation(line: 0, scope: !105, inlinedAt: !1022)
!1022 = distinct !DILocation(line: 530, column: 9, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 529, column: 62)
!1024 = !DILocation(line: 666, column: 13, scope: !105, inlinedAt: !1022)
!1025 = !DILocation(line: 665, column: 5, scope: !105, inlinedAt: !1022)
!1026 = !DILocation(line: 667, column: 5, scope: !105, inlinedAt: !1022)
!1027 = !DILocation(line: 0, scope: !527, inlinedAt: !1028)
!1028 = distinct !DILocation(line: 533, column: 12, scope: !1009)
!1029 = !DILocation(line: 447, column: 13, scope: !527, inlinedAt: !1028)
!1030 = !DILocation(line: 533, column: 5, scope: !1009)
!1031 = distinct !DISubprogram(name: "expand_memory", scope: !3, file: !3, line: 539, type: !102, scopeLine: 539, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!1032 = !DILocation(line: 0, scope: !105, inlinedAt: !1033)
!1033 = distinct !DILocation(line: 541, column: 5, scope: !1031)
!1034 = !DILocation(line: 666, column: 13, scope: !105, inlinedAt: !1033)
!1035 = !DILocation(line: 665, column: 5, scope: !105, inlinedAt: !1033)
!1036 = !DILocation(line: 667, column: 5, scope: !105, inlinedAt: !1033)
!1037 = distinct !DISubprogram(name: "get_function_from_table", scope: !3, file: !3, line: 553, type: !1038, scopeLine: 553, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1040)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!620, !7, !7}
!1040 = !{!1041, !1042, !1043}
!1041 = !DILocalVariable(name: "idx", arg: 1, scope: !1037, file: !3, line: 553, type: !7)
!1042 = !DILocalVariable(name: "type_id", arg: 2, scope: !1037, file: !3, line: 553, type: !7)
!1043 = !DILocalVariable(name: "f", scope: !1037, file: !3, line: 558, type: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "table_entry", file: !3, line: 544, size: 64, elements: !1045)
!1045 = !{!1046, !1047}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "type_id", scope: !1044, file: !3, line: 545, baseType: !7, size: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "func_ptr", scope: !1044, file: !3, line: 546, baseType: !6, size: 32, offset: 32)
!1048 = !DILocation(line: 0, scope: !1037)
!1049 = !DILocation(line: 554, column: 30, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 554, column: 9)
!1051 = !DILocation(line: 554, column: 9, scope: !1037)
!1052 = !DILocation(line: 0, scope: !105, inlinedAt: !1053)
!1053 = distinct !DILocation(line: 555, column: 9, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 554, column: 54)
!1055 = !DILocation(line: 666, column: 13, scope: !105, inlinedAt: !1053)
!1056 = !DILocation(line: 665, column: 5, scope: !105, inlinedAt: !1053)
!1057 = !DILocation(line: 667, column: 5, scope: !105, inlinedAt: !1053)
!1058 = !DILocation(line: 558, column: 28, scope: !1037)
!1059 = !DILocation(line: 560, column: 36, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 560, column: 9)
!1061 = !DILocation(line: 560, column: 50, scope: !1060)
!1062 = !DILocation(line: 560, column: 47, scope: !1060)
!1063 = !DILocation(line: 560, column: 9, scope: !1037)
!1064 = !DILocation(line: 0, scope: !105, inlinedAt: !1065)
!1065 = distinct !DILocation(line: 561, column: 9, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 560, column: 71)
!1067 = !DILocation(line: 666, column: 13, scope: !105, inlinedAt: !1065)
!1068 = !DILocation(line: 665, column: 5, scope: !105, inlinedAt: !1065)
!1069 = !DILocation(line: 667, column: 5, scope: !105, inlinedAt: !1065)
!1070 = !DILocation(line: 564, column: 5, scope: !1037)
!1071 = distinct !DISubprogram(name: "add_function_to_table", scope: !3, file: !3, line: 567, type: !1072, scopeLine: 567, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1074)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{null, !7, !7, !6}
!1074 = !{!1075, !1076, !1077}
!1075 = !DILocalVariable(name: "idx", arg: 1, scope: !1071, file: !3, line: 567, type: !7)
!1076 = !DILocalVariable(name: "type_id", arg: 2, scope: !1071, file: !3, line: 567, type: !7)
!1077 = !DILocalVariable(name: "func_ptr", arg: 3, scope: !1071, file: !3, line: 567, type: !6)
!1078 = !DILocation(line: 0, scope: !1071)
!1079 = !DILocation(line: 568, column: 30, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 568, column: 9)
!1081 = !DILocation(line: 568, column: 9, scope: !1071)
!1082 = !DILocation(line: 0, scope: !105, inlinedAt: !1083)
!1083 = distinct !DILocation(line: 569, column: 9, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1080, file: !3, line: 568, column: 54)
!1085 = !DILocation(line: 666, column: 13, scope: !105, inlinedAt: !1083)
!1086 = !DILocation(line: 665, column: 5, scope: !105, inlinedAt: !1083)
!1087 = !DILocation(line: 667, column: 5, scope: !105, inlinedAt: !1083)
!1088 = !DILocation(line: 572, column: 18, scope: !1071)
!1089 = !DILocation(line: 572, column: 26, scope: !1071)
!1090 = !{!1091, !113, i64 0}
!1091 = !{!"table_entry", !113, i64 0, !92, i64 4}
!1092 = !DILocation(line: 573, column: 18, scope: !1071)
!1093 = !DILocation(line: 573, column: 27, scope: !1071)
!1094 = !{!1091, !92, i64 4}
!1095 = !DILocation(line: 574, column: 1, scope: !1071)
!1096 = distinct !DISubprogram(name: "clear_table", scope: !3, file: !3, line: 576, type: !102, scopeLine: 576, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!1097 = !DILocation(line: 577, column: 5, scope: !1096)
!1098 = !DILocation(line: 578, column: 1, scope: !1096)
!1099 = !DILocation(line: 0, scope: !105)
!1100 = !DILocation(line: 666, column: 13, scope: !105)
!1101 = !DILocation(line: 665, column: 5, scope: !105)
!1102 = !DILocation(line: 667, column: 5, scope: !105)
!1103 = !DILocation(line: 0, scope: !804)
!1104 = !DILocation(line: 677, column: 13, scope: !804)
!1105 = !DILocation(line: 676, column: 12, scope: !804)
